using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace QUESTionBot
{
    static class TextTemplates
    {
        public static string greetingMessage = "Приветствую! Я - QUESTion Bot, бот, созданный для сегодняшнего квеста. " +
            "\nЕсли ты обратился ко мне, то, полагаю, что ты являешься капитаном команды, и мы будем взаимодействовать в течение сегодняшнего дня. Давай перед началом я вкратце напомню правила:" +
            "\n\n1) Чтобы принимать участие в квесте, вы должны соблюдать правила ПДД и бла-бла-бла (Катя напишет что здесь писать)" +
            "\n2) Чтобы начать квест и дать мне понять, что вы являетесь зарегистрированной командой, вам надо будет отправить мне полученный вами ключ. Ключ" +
            "отправляет только один человек от команды - её капитан." +
            "\n3) При подходах к станциям вам надо будет присылать мне специальное кодовое слово, чтобы я понял, что вы точно на месте. Как только вы отправляете" +
            "слово, начинается отчсёт времени, данного вам на задание." +
            "\n4) По итогам задания вам надо будет пройти тест от меня. Когда вы ответите на последнее задание, я остановлю таймер и вышлю вам новую геометку, чтобы вы знали," +
            "куда вам направляться." +
            "\n5) В конце мы подводим итоги, исходя из пройденных вами тестов." +
            "Желаю удачи! Чтобы продолжить, дайте мне знать, что вы согласны со всеми правилами проведения:";
    }
}
